Quetzalcoatlus2/Embedded-MSP430FR2355/signal generator.c
volatile long precalculated_offset_dac_units;


// UART input buffer for phase command values
#define PHASE_INPUT_BUFFER_SIZE 4
char phase_input_buffer[PHASE_INPUT_BUFFER_SIZE];
unsigned char phase_input_buffer_idx = 0;
unsigned int current_phase_offset_samples = 0;





// UART receive state machine modes
typedef enum {
    NORMAL_COMMAND_MODE,
    FREQUENCY_INPUT_MODE,
    AMPLITUDE_INPUT_MODE,
    OFFSET_INPUT_MODE,
    PHASE_INPUT_MODE
} UART_RX_State;


UART_RX_State uart_rx_state = NORMAL_COMMAND_MODE;







// TB2 CCR0 increment controlling output frequency
volatile unsigned int timer_b0_ccr0_increment = 666;



// Main initialization and runtime setup
int main(void)
{



    WDTCTL = WDTPW | WDTHOLD;




    for(i=0; i<300; i++)
    {
        if(i < 150) square_wave[i] = 4095;
        else square_wave[i] = 0;
    }




    for(i=0; i<300; i++)
    {
        if(i < 3) pulse_train_wave[i] = 4095;
        else pulse_train_wave[i] = 0;
    }



    waveform_slots[0] = sine_wave;
    waveform_slots[1] = sine_wave;
    waveform_slots[2] = sine_wave;


    current_amplitude_percentage = 100;

    current_amplitude_scaling_factor = ((long)current_amplitude_percentage * 256) / 100;
    current_offset_mv = 1650;

    precalculated_offset_dac_units = ((long)current_offset_mv * 4095L) / 3300L;
    current_phase_offset_samples = 0;




    FRCTL0 = FRCTLPW | NWAITS_2;



    __bis_SR_register(SCG0);

    CSCTL3 = SELREF__REFOCLK;



    CSCTL1 = DCOFTRIMEN_1 | DCOFTRIM0 | DCOFTRIM1 | DCORSEL_6;




    CSCTL2 = FLLD_0 + 731;

    __delay_cycles(3);

    __bic_SR_register(SCG0);

    Software_Trim();



    CSCTL4 = SELMS__DCOCLKDIV | SELA__REFOCLK;


    current_waveform_index = 0;





    P1SEL0 |= BIT5;
    P1SEL1 |= BIT5;



    P4SEL0 |= BIT2 | BIT3;
    P4SEL1 &=~(BIT2 | BIT3);



    UCA1CTLW0 |= UCSWRST;

    UCA1CTLW0 |= UCSSEL_2;



    UCA1BR0 = 13;
    UCA1BR1 = 0x00;




    UCA1MCTLW = (0x44 << 8) | (0 << 4) | UCOS16;



    P3DIR |= BIT0; P3SEL0 |= BIT0; P3SEL1 &= ~BIT0;

    P3DIR |= BIT4; P3SEL0 |= BIT4; P3SEL1 &= ~BIT4;



    P1SEL0 |=  BIT0 + BIT1 + BIT2;
    P1SEL1 |=  BIT0 + BIT1 + BIT2;



    PM5CTL0 &= ~LOCKLPM5;




    PMMCTL0_H = PMMPW_H;
    PMMCTL2 |= INTREFEN;

    __delay_cycles(400);


    UCA1CTLW0 &= ~UCSWRST;


    uart_send_string("\r\n--- MSP430 Waveform Generator ---\r\n");
    uart_send_string("Waveform assignment (applies to the selected assignment slot):\r\n");
    uart_send_string(" s : Sine\r\n t : Triangle\r\n r : Ramp\r\n p : Square\r\n c : Pulse\r\n");
    uart_send_string("Select assignment slot:\r\n X:Slot 0, Y:Slot 1, Z:Slot 2\r\n");
    uart_send_string("Select DAC output slot:\r\n L:Slot 0, M:Slot 1, N:Slot 2\r\n");
    uart_send_string("Other commands:\r\n");
    uart_send_string(" F : Set Frequency (1-10000 Hz)\r\n");
    uart_send_string(" A : Set Amplitude (0-100 %)\r\n");
    uart_send_string(" O : Set Offset (0-3300 mV)\r\n");
    uart_send_string(" H : Set Phase (0-299 samples)\r\n");
    uart_send_string(" # : Send ADC Data\r\n");
    uart_send_string("current: Slot 0->0, Freq ~100Hz, Ampl 100%, Offset 1650mV, Phase 0.\r\n");
    uart_send_string("> ");



    UCA1IE |= UCRXIE;




    ADCCTL0 |= ADCSHT_10 | ADCON;



    ADCCTL1 |= ADCSHP | ADCSHS_2 | ADCCONSEQ_3;


    ADCCTL2 &= ~ADCRES;
    ADCCTL2 |= ADCRES_2;



    ADCMCTL0 |= ADCINCH_2;

    ADCIE |= ADCIE0;





    SAC1DAC = DACSREF_0 + DACLSEL_0 + DACIE;

    SAC1DAT = DAC_data;

    SAC1DAC |= DACEN;






    SAC1OA = NMUXEN + PMUXEN + PSEL_1 + NSEL_1;
    SAC1OA |= OAPM_0;


    SAC1PGA = MSEL_1;


    SAC1OA |= SACEN + OAEN;




    TB2CCR0 = timer_b0_ccr0_increment;

    TB2CCR1 = 10;

    TB2CCTL0 = CCIE;

    TB2CCTL1 = CCIE;







    TB2CTL |= TBSSEL__SMCLK | ID_0 | TBCLR | MC__CONTINOUS| TBIE;




    TB1CCR0 = 326;



    TB1CCTL1 = OUTMOD_7;

    TB1CCR1 = 163;




    TB1CTL = TBSSEL__ACLK | MC__UP | TBCLR;


    ADC_i = 2;

    i=0;


    ADCCTL0 |= ADCENC;

    TB1CTL |= TBCLR;



    __bis_SR_register(GIE);



    __no_operation();
}


void uart_send_string(const char *str)
{

    while (*str)
    {


        while (!(UCA1IFG & UCTXIFG));

        UCA1TXBUF = *str++;
    }


    while (UCA1STATW & UCBUSY);
}



// Send an unsigned integer as ASCII over UART
void uart_send_uint(unsigned int val) {
    char buffer[6];
    int k = 0;


    if (val == 0) {
        while(!(UCA1IFG&UCTXIFG)); UCA1TXBUF = '0';
        return;
    }

    unsigned int temp = val;

    do {
        buffer[k++] = (temp % 10) + '0';
        temp /= 10;
    } while (temp > 0 && k < 5);


    while (k > 0) {
        while(!(UCA1IFG&UCTXIFG)); UCA1TXBUF = buffer[--k];
    }
}



#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
// ADC ISR: collect conversion results into ADC_Result[]
#pragma vector=ADC_VECTOR
__interrupt void ADC_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(ADC_VECTOR))) ADC_ISR (void)
#else
#error Compiler not supported!
#endif
{


    switch(__even_in_range(ADCIV,ADCIV_ADCIFG))
    {
        case ADCIV_NONE:
            break;
        case ADCIV_ADCOVIFG:
            break;
        case ADCIV_ADCTOVIFG:
            break;
        case ADCIV_ADCHIIFG:
            break;
        case ADCIV_ADCLOIFG:
            break;
        case ADCIV_ADCINIFG:
            break;
        case ADCIV_ADCIFG:

            ADC_Result[ADC_i] = ADCMEM0;





            if(ADC_i == 0)
            {
                __no_operation();
                ADC_i = 2;
            }
            else
            {
                ADC_i--;
            }
            break;
        default:
            break;
    }
}




#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
// UART RX ISR: command parser and parameter input handling
#pragma vector=USCI_A1_VECTOR
__interrupt void USCI_A1_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCI_A1_VECTOR))) USCI_A1_ISR(void)
#else
#error Compiler not supported!
#endif
{
  char received_char;


  switch(__even_in_range(UCA1IV,USCI_UART_UCTXCPTIFG))
  {
    case USCI_NONE: break;
    case USCI_UART_UCRXIFG:
        received_char = UCA1RXBUF;


        while(!(UCA1IFG&UCTXIFG));
        UCA1TXBUF = received_char;


        if (uart_rx_state == FREQUENCY_INPUT_MODE)
        {
            if (received_char == '\r' || received_char == '\n')
            {
                uart_send_string("\r\n");
                if (freq_input_buffer_idx > 0)
                {
                    freq_input_buffer[freq_input_buffer_idx] = '\0';
                    unsigned long requested_freq_hz = atoi(freq_input_buffer);


                    if (requested_freq_hz >= 1 && requested_freq_hz <= 10000)
                    {
                        unsigned long calc_increment;



                        calc_increment = 24000000UL / requested_freq_hz;
                        calc_increment /= 300UL;


