Quetzalcoatlus2/Embedded-MSP430FR2355/signal generator.c
                        const unsigned int MIN_CCR_INCREMENT = 7;
                        const unsigned int MAX_CCR_INCREMENT = 65535;

                        if (calc_increment < MIN_CCR_INCREMENT) {
                            timer_b0_ccr0_increment = MIN_CCR_INCREMENT;
                        } else if (calc_increment > MAX_CCR_INCREMENT) {
                            timer_b0_ccr0_increment = MAX_CCR_INCREMENT;
                        } else {
                            timer_b0_ccr0_increment = (unsigned int)calc_increment;
                        }



                        unsigned long term_calc = (24000000UL / 300UL) * 1000UL;
                        unsigned long actual_freq_milihz = term_calc / (unsigned long)timer_b0_ccr0_increment;

                        unsigned int actual_hz = actual_freq_milihz / 1000;
                        unsigned int actual_tenths = (actual_freq_milihz % 1000) / 100;

                        uart_send_string("Target: "); uart_send_uint(requested_freq_hz); uart_send_string("Hz. ");
                        uart_send_string("Actual: "); uart_send_uint(actual_hz); uart_send_string("."); uart_send_uint(actual_tenths);
                        uart_send_string("Hz (CCR Inc: "); uart_send_uint(timer_b0_ccr0_increment); uart_send_string(")\r\n> ");
                    }
                    else
                    {

                        uart_send_string("Invalid frequency. Valid range: 1-10000 Hz.\r\nEffective range approx 1-11428 Hz.\r\n> ");
                    }
                } else {
                     uart_send_string("No frequency was entered.\r\n> ");
                }
                uart_rx_state = NORMAL_COMMAND_MODE;
                freq_input_buffer_idx = 0;
                memset(freq_input_buffer, 0, FREQ_INPUT_BUFFER_SIZE);
            }

            else if (received_char >= '0' && received_char <= '9' && freq_input_buffer_idx < (FREQ_INPUT_BUFFER_SIZE - 1))
            {
                freq_input_buffer[freq_input_buffer_idx++] = received_char;
            }

            else if ((received_char == '\b' || received_char == 127) && freq_input_buffer_idx > 0)
            {
                freq_input_buffer_idx--;
                uart_send_string(" \b");
            }
        }
        else if (uart_rx_state == AMPLITUDE_INPUT_MODE)
        {
            if (received_char == '\r' || received_char == '\n')
            {
                uart_send_string("\r\n");
                if (amplitude_input_buffer_idx > 0)
                {
                    amplitude_input_buffer[amplitude_input_buffer_idx] = '\0';
                    int requested_amplitude = atoi(amplitude_input_buffer);


                    if (requested_amplitude >= 0 && requested_amplitude <= 100)
                    {
                        current_amplitude_percentage = (unsigned int)requested_amplitude;

                        current_amplitude_scaling_factor = ((long)current_amplitude_percentage * 256) / 100;
                        uart_send_string("Amplitude set to: ");
                        uart_send_uint(current_amplitude_percentage);
                        uart_send_string(" %\r\n> ");
                    }
                    else
                    {
                        uart_send_string("Invalid amplitude. Enter a value between 0-100 %.\r\n> ");
                    }
                } else {
                     uart_send_string("No amplitude was entered.\r\n> ");
                }
                uart_rx_state = NORMAL_COMMAND_MODE;
                amplitude_input_buffer_idx = 0;
                memset(amplitude_input_buffer, 0, AMPLITUDE_INPUT_BUFFER_SIZE);
            }

            else if (received_char >= '0' && received_char <= '9' && amplitude_input_buffer_idx < (AMPLITUDE_INPUT_BUFFER_SIZE - 1))
            {
                amplitude_input_buffer[amplitude_input_buffer_idx++] = received_char;
            }

            else if ((received_char == '\b' || received_char == 127) && amplitude_input_buffer_idx > 0)
            {
                amplitude_input_buffer_idx--;
                uart_send_string(" \b");
            }
        }
        else if (uart_rx_state == OFFSET_INPUT_MODE)
        {
            if (received_char == '\r' || received_char == '\n')
            {
                uart_send_string("\r\n");
                if (offset_input_buffer_idx > 0)
                {
                    offset_input_buffer[offset_input_buffer_idx] = '\0';

                    long requested_offset_mv = atol(offset_input_buffer);


                    if (requested_offset_mv >= 0 && requested_offset_mv <= 3300)
                    {
                        current_offset_mv = (unsigned int)requested_offset_mv;

                        precalculated_offset_dac_units = ((long)current_offset_mv * 4095L) / 3300L;
                        uart_send_string("Offset set to: ");
                        uart_send_uint(current_offset_mv);
                        uart_send_string(" mV\r\n> ");
                    }
                    else
                    {
                        uart_send_string("Invalid offset. Enter a value between 0-3300 mV.\r\n> ");
                    }
                } else {
                     uart_send_string("No offset value was entered.\r\n> ");
                }
                uart_rx_state = NORMAL_COMMAND_MODE;
                offset_input_buffer_idx = 0;
                memset(offset_input_buffer, 0, OFFSET_INPUT_BUFFER_SIZE);
            }

            else if (received_char >= '0' && received_char <= '9' && offset_input_buffer_idx < (OFFSET_INPUT_BUFFER_SIZE - 1))
            {
                offset_input_buffer[offset_input_buffer_idx++] = received_char;
            }

            else if ((received_char == '\b' || received_char == 127) && offset_input_buffer_idx > 0)
            {
                offset_input_buffer_idx--;
                uart_send_string(" \b");
            }
        }
        else if (uart_rx_state == PHASE_INPUT_MODE)
        {
            if (received_char == '\r' || received_char == '\n')
            {
                uart_send_string("\r\n");
                if (phase_input_buffer_idx > 0)
                {
                    phase_input_buffer[phase_input_buffer_idx] = '\0';
                    int requested_phase = atoi(phase_input_buffer);


                    if (requested_phase >= 0 && requested_phase < 300)
                    {
                        current_phase_offset_samples = (unsigned int)requested_phase;
                        uart_send_string("Phase set to: ");
                        uart_send_uint(current_phase_offset_samples);
                        uart_send_string(" samples\r\n> ");
                    }
                    else
                    {
                        uart_send_string("Invalid phase. Enter a value between 0-299 samples.\r\n> ");
                    }
                } else {
                     uart_send_string("No phase value was entered.\r\n> ");
                }
                uart_rx_state = NORMAL_COMMAND_MODE;
                phase_input_buffer_idx = 0;
                memset(phase_input_buffer, 0, PHASE_INPUT_BUFFER_SIZE);
            }

