Quetzalcoatlus2/Embedded-MSP430FR2355/signal generator.c
    long offset_dac_units = precalculated_offset_dac_units;



    long final_value_long = offset_dac_units + scaled_relative_sample;


    if (final_value_long < 0) final_value_long = 0;
    if (final_value_long > 4095) final_value_long = 4095;



    SAC1DAT = (unsigned int)final_value_long;
}



#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
// Timer B2 secondary ISR (CCR1 / overflow bookkeeping)
#pragma vector = TIMER2_B1_VECTOR
__interrupt void Timer2_B1_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(TIMER2_B1_VECTOR))) Timer2_B1_ISR (void)
#else
#error Compiler not supported!
#endif
{

    switch(TB2IV)
    {
        case TBIV__NONE:
            break;
        case TBIV__TBCCR1:
            TB2CCR1 += 10;


            break;
        case TBIV__TBIFG:
            break;
        default:
            break;
    }
}




void Software_Trim()
{

    unsigned int oldDcoTap = 0xffff;
    unsigned int newDcoTap = 0xffff;
    unsigned int newDcoDelta = 0xffff;
    unsigned int bestDcoDelta = 0xffff;
    unsigned int csCtl0Copy = 0;
    unsigned int csCtl1Copy = 0;
    unsigned int csCtl0Read = 0;
    unsigned int csCtl1Read = 0;
    unsigned int dcoFreqTrim = 3;
    unsigned char endLoop = 0;

    do
    {

        CSCTL0 = 0x100;
        do
        {


            CSCTL7 &= ~DCOFFG;
        }while (CSCTL7 & DCOFFG);



        __delay_cycles((unsigned int)3000 * MCLK_FREQ_MHZ);



        while((CSCTL7 & (FLLUNLOCK0 | FLLUNLOCK1)) && ((CSCTL7 & DCOFFG) == 0));


        csCtl0Read = CSCTL0;
        csCtl1Read = CSCTL1;

        oldDcoTap = newDcoTap;
        newDcoTap = csCtl0Read & 0x01ff;
        dcoFreqTrim = (csCtl1Read & 0x0070)>>4;



        if(newDcoTap < 256)
        {
            newDcoDelta = 256 - newDcoTap;

            if((oldDcoTap != 0xffff) && (oldDcoTap >= 256))
                endLoop = 1;
            else
            {
                dcoFreqTrim--;
                CSCTL1 = (csCtl1Read & (~DCOFTRIM)) | (dcoFreqTrim<<4);
            }
        }
        else
        {
            newDcoDelta = newDcoTap - 256;

            if(oldDcoTap < 256)
                endLoop = 1;
            else
            {
                dcoFreqTrim++;
                CSCTL1 = (csCtl1Read & (~DCOFTRIM)) | (dcoFreqTrim<<4);
            }
        }


        if(newDcoDelta < bestDcoDelta)
        {
            csCtl0Copy = csCtl0Read;
            csCtl1Copy = csCtl1Read;
            bestDcoDelta = newDcoDelta;
        }

    }while(endLoop == 0);


    CSCTL0 = csCtl0Copy;
    CSCTL1 = csCtl1Copy;

    while(CSCTL7 & (FLLUNLOCK0 | FLLUNLOCK1));
}
